export type Region = {
  name: string;
  countries: string[];
};

export const regions: Region[] = [
  {
    name: 'アジア',
    countries: [
      '韓国', '中国', '台湾', '香港', 'モンゴル',
      'タイ', 'ベトナム', 'シンガポール', 'マレーシア', 'インドネシア',
      'フィリピン', 'カンボジア', 'ミャンマー', 'ラオス', 'ブルネイ', '東ティモール',
      'インド', 'スリランカ', 'ネパール', 'ブータン', 'バングラデシュ', 'パキスタン',
      'モルディブ', 'アフガニスタン',
      '北朝鮮',
    ],
  },
  {
    name: 'ヨーロッパ',
    countries: [
      'イギリス', 'フランス', 'ドイツ', 'イタリア', 'スペイン',
      'ポルトガル', 'オランダ', 'ベルギー', 'ルクセンブルク', 'スイス',
      'オーストリア', 'アイルランド', 'アイスランド',
      'デンマーク', 'スウェーデン', 'ノルウェー', 'フィンランド',
      'ポーランド', 'チェコ', 'スロバキア', 'ハンガリー', 'ルーマニア', 'ブルガリア',
      'クロアチア', 'セルビア', 'スロベニア', 'ボスニア・ヘルツェゴビナ',
      'モンテネグロ', '北マケドニア', 'アルバニア', 'コソボ',
      'ギリシャ', 'キプロス', 'マルタ',
      'エストニア', 'ラトビア', 'リトアニア',
      'ウクライナ', 'ベラルーシ', 'モルドバ',
      'ジョージア', 'アルメニア', 'アゼルバイジャン',
      'ロシア',
      'モナコ', 'リヒテンシュタイン', 'サンマリノ', 'バチカン', 'アンドラ',
    ],
  },
  {
    name: '北米',
    countries: [
      'アメリカ', 'カナダ',
    ],
  },
  {
    name: '中南米・カリブ',
    countries: [
      'メキシコ', 'グアテマラ', 'ベリーズ', 'ホンジュラス', 'エルサルバドル',
      'ニカラグア', 'コスタリカ', 'パナマ',
      'キューバ', 'ジャマイカ', 'ハイチ', 'ドミニカ共和国', 'トリニダード・トバゴ',
      'バハマ', 'バルバドス', 'セントルシア', 'アンティグア・バーブーダ',
      'グレナダ', 'セントビンセント・グレナディーン', 'セントクリストファー・ネイビス',
      'ドミニカ国',
      'コロンビア', 'ベネズエラ', 'エクアドル', 'ペルー', 'ボリビア',
      'ブラジル', 'アルゼンチン', 'チリ', 'ウルグアイ', 'パラグアイ',
      'ガイアナ', 'スリナム',
    ],
  },
  {
    name: '中東',
    countries: [
      'トルコ', 'アラブ首長国連邦', 'サウジアラビア', 'カタール', 'バーレーン',
      'クウェート', 'オマーン', 'イエメン',
      'イスラエル', 'パレスチナ', 'ヨルダン', 'レバノン', 'シリア', 'イラク', 'イラン',
    ],
  },
  {
    name: 'アフリカ',
    countries: [
      'エジプト', 'モロッコ', 'チュニジア', 'アルジェリア', 'リビア',
      '南アフリカ', 'ケニア', 'タンザニア', 'エチオピア', 'ウガンダ', 'ルワンダ',
      'ガーナ', 'ナイジェリア', 'セネガル', 'コートジボワール', 'カメルーン',
      'コンゴ民主共和国', 'コンゴ共和国',
      'マダガスカル', 'モーリシャス', 'セーシェル',
      'ナミビア', 'ボツワナ', 'ジンバブエ', 'ザンビア', 'モザンビーク',
      'アンゴラ',
      'マリ', 'ブルキナファソ', 'ニジェール', 'チャド', 'スーダン', '南スーダン',
      'ソマリア', 'ジブチ', 'エリトリア',
      'ベナン', 'トーゴ', 'シエラレオネ', 'リベリア', 'ギニア', 'ギニアビサウ',
      'ガンビア', 'カーボベルデ', 'サントメ・プリンシペ',
      '赤道ギニア', 'ガボン', '中央アフリカ', 'ブルンジ',
      'マラウイ', 'レソト', 'エスワティニ', 'コモロ',
      'モーリタニア',
    ],
  },
  {
    name: 'オセアニア',
    countries: [
      'オーストラリア', 'ニュージーランド',
      'フィジー', 'パプアニューギニア', 'サモア', 'トンガ', 'バヌアツ',
      'ソロモン諸島', 'キリバス', 'ミクロネシア連邦', 'マーシャル諸島', 'パラオ',
      'ツバル', 'ナウル',
    ],
  },
];

export const prefectures = [
  '北海道', '青森県', '岩手県', '宮城県', '秋田県', '山形県', '福島県',
  '茨城県', '栃木県', '群馬県', '埼玉県', '千葉県', '東京都', '神奈川県',
  '新潟県', '富山県', '石川県', '福井県', '山梨県', '長野県', '岐阜県',
  '静岡県', '愛知県', '三重県', '滋賀県', '京都府', '大阪府', '兵庫県',
  '奈良県', '和歌山県', '鳥取県', '島根県', '岡山県', '広島県', '山口県',
  '徳島県', '香川県', '愛媛県', '高知県', '福岡県', '佐賀県', '長崎県',
  '熊本県', '大分県', '宮崎県', '鹿児島県', '沖縄県',
];
